{
  "page": 1,
  "page_count": 23902,
  "items_per_page": 20,
  "took": 26,
  "timed_out": false,
  "total": 478031,
  "results": [
    {
      "contents": "<p>Explore opportunities with [agency name], a part of LHC Group, a leading post-acute care partner for hospitals, physicians and families nationwide. As members of the Optum family of businesses, we are dedicated to helping people feel their best, including our team members who create meaningful connections with patients, their families, each other and the communities we serve. Find a home for your career here. Join us and embrace a culture of <strong>Caring. Connecting. Growing together.</strong></p>\n\n<p><br>As the Physical Therapist in Home Health, you will be completing assessments and evaluations of patient care needs related to functional status/mobility, endurance/stamina, pain and other medical conditions. Based on this assessment and evaluation, you will work to help determine a treatment plan, perform interventions aimed at improving and enhancing the patient's well-being, and evaluate the patient's progress.</p>\n\n<p><strong>Primary Responsibilities:</strong></p>\n\n<ul><li>Evaluates the patient's functional status and physical therapy needs. Assists the physician in the development of the therapy plan of care</li><li>Provides services within the scope of practice as defined by the state laws governing the practice of physical therapy, in accordance with the plan of care, and in coordination with other members of the health care team</li><li>Observes and reports the patient's response to treatment and any changes in his/her condition to the supervising nurse and/or the physician</li><li>Treats patients to relieve pain, develop and restore function, and/or maintain maximum functioning using acceptable standards of practice</li><li>Instructs and informs participating members of the health care team, the patient, and the family/caregivers regarding the plan of care, functional limitations, and progress toward goals</li><li>Visits patients according to Plan of Treatment, completes a progress note for each visit, and submits progress notes per LHC policy</li><li>Completes all patient evaluations and develops the PT plan of care within state specific guidelines</li><li>Reports outcomes of evaluation, goals, and anticipated projected frequency of care<br> </li></ul>\n\n<p>You'll be rewarded and recognized for your performance in an environment that will challenge you and give you clear direction on what it takes to succeed in your role as well as provide development for other roles you may be interested in. </p>\n\n<p><strong>Required Qualifications:</strong></p>\n\n<ul><li>Current Physical Therapy licensure in state of New Mexico    </li><li>Current CPR certification</li><li>Current driver's license and vehicle insurance, access to a dependable vehicle, or public transportation</li><li>Ability to function in any home situation regardless of age, race, creed, color, sex, disability, or financial condition of the client  </li></ul>\n\n<p>\n </p>\n\n<p>\n Pay is based on several factors including but not limited to local labor markets, education, work experience, certifications, etc. In addition to your salary, we offer benefits such as, a comprehensive benefits package, incentive and recognition programs, equity stock purchase and 401k contribution (all benefits are subject to eligibility requirements). No matter where or when you begin a career with us, you'll find a far-reaching choice of benefits and incentives. The hourly pay for this role will range from $34.23 to $61.15 per hour based on full-time employment. We comply with all minimum wage laws as applicable. </p>\n\n<p> </p>\n\n<p>#LHCJobs\n </p>\n\n<p><br><i>At UnitedHealth Group, our mission is to help people live healthier lives and make the health system work better for everyone. We believe everyone-of every race, gender, sexuality, age, location and income-deserves the opportunity to live their healthiest life. Today, however, there are still far too many barriers to good health which are disproportionately experienced by people of color, historically marginalized groups and those with lower incomes. We are committed to mitigating our impact on the environment and enabling and delivering equitable care that addresses health disparities and improves health outcomes - an enterprise priority reflected in our mission. </i><br><i> </i><br><i> </i><br><i>UnitedHealth Group is an Equal Employment Opportunity employer under applicable law and qualified applicants will receive consideration for employment without regard to race, national origin, religion, age, color, sex, sexual orientation, gender identity, disability, or protected veteran status, or any other characteristic protected by local, state, or federal laws, rules, or regulations. </i><br><i> </i><br><i> </i><br><i>UnitedHealth Group is a drug - free workplace. Candidates are required to pass a drug test before beginning employment. </i><br> </p>",
      "name": "Physical Therapist",
      "type": "external",
      "publication_date": "2026-01-14T07:35:18Z",
      "short_name": "physical-therapist-436849",
      "model_type": "jobs",
      "id": 21091128,
      "locations": [
        {
          "name": "Albuquerque, NM"
        }
      ],
      "categories": [],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/optum/physical-therapist-436849"
      },
      "company": {
        "id": 15000934,
        "short_name": "optum",
        "name": "Optum"
      }
    },
    {
      "contents": "<div>\n Safety-Kleen in Sylmar, CA is seeking a Driver Operations Manager (Service Delivery Manager) manage the daily completion of routes by motivating and directing team members; as well as ensuring a high level of customer satisfaction. This role does this while still having a strong operational adherence to all DOT, EPA, State and Local Regulations and Safety-Kleen Policies and Procedures.\n</div>\n\n<div>\n <br> \n</div>\n\n<div>\n Safety-Kleen, a subsidiary of Clean Harbors is the leading provider of environmental, energy and industrial services throughout the United States, Canada, Mexico and Puerto Rico.  Everywhere industry meets environment, Clean Harbors is on-site, providing premier environmental, energy and industrial services. We are solving tough problems through innovation and proven methodology – come be part of the solution with us.\n</div>\n\n<div>\n <br> \n</div>\n\n<div>\n <strong>Why work for Clean Harbors?</strong>\n</div>\n\n<div>\n <ul>\n  <li>Health and Safety is our #1 priority and we live it 3-6-5!</li>\n  <li>Focus on maintaining sustainability and cleaning the Earth </li>\n  <li>Recruiting Pay range $75k-$80k </li>\n  <li>Comprehensive health benefits coverage after 30 days of full-time employment including 401K with Company match</li>\n  <li>Own part of the company with our Employee Stock Purchase Plan</li>\n  <li>Opportunities for growth and development for all the stages of your career</li>\n  <li>Company paid training and tuition reimbursement</li>\n </ul>\n</div>\n\n<div>\n <ul>\n  <li>Ensure Health and Safety is the number one priority by complying with all safe work practices, policies, and processes and always acting in a safe manner</li>\n  <li>Train, develop, and manage sales and service route drivers</li>\n  <li>Manage flow of service requests to ensure customers are serviced in a timely and efficient manner</li>\n  <li>Conduct End-of-day Check-In / Morning Check-Out process with drivers to ensure daily expectations are met and employees are prepared for the day</li>\n  <li>Fulfill duties of route driver when s/he is absent</li>\n  <li>Provide field coaching and sales training to route drivers</li>\n  <li>Meet with customers periodically to discuss needs</li>\n  <li>Increase sales portfolio by identifying opportunities</li>\n  <li>Schedule services to prevent and resolve route issues and complaints</li>\n  <li>Ensure completion and organization of all mandated paperwork and files.</li>\n  <li>Follow all local, state (provincial) and federal compliance regulations and rules</li>\n  <li>Safely operate vehicles in accordance with U.S. DOT, local, state (provincial) and federal requirements</li>\n  <li>Safely observe all corporate operating guidelines and procedures</li>\n  <li>Observe all company environmental health and safety operating guidelines</li>\n  <li>Perform other duties as assigned</li>\n </ul>\n</div>\n\n<div>\n <ul>\n  <li>Class B CDL</li>\n  <li>Obtain Hazmat and Tanker endorsements within 90 days of employment</li>\n  <li>Leadership experience</li>\n  <li>Intermediate computer skills</li>\n  <li>Excellent customer service skills </li>\n  <li>Excellent organization and attention to detail</li>\n  <li>Perform physical functions per job requirements</li>\n  <li>Successfully complete a background check, drug test, and physical, by position</li>\n </ul>\n</div>\n\n<div>\n <strong>Preferred Qualifications:</strong>\n</div>\n\n<div>\n <ul>\n  <li>Previous route driver experience</li>\n  <li>Previous dispatch/logistics experience</li>\n </ul>\n</div>\n\n<div>\n <br> \n</div>\n\n<div>\n Clean Harbors is an equal opportunity employer. We do not discriminate against applicants due to race, ancestry, color, sexual orientation, gender identity, national origin, religion, age, physical or mental disability, veteran status, or based on any other federal, state/provincial, or local protected class. \n</div>\n\n<div>\n <br> \n</div>\n\n<div>\n Clean Harbors is a Military &amp; Veteran friendly company.\n</div>\n\n<div>\n *SK\n</div>\n\n<div>\n <br> \n</div>",
      "name": "Service Delivery Manager",
      "type": "external",
      "publication_date": "2025-03-01T10:22:33Z",
      "short_name": "service-delivery-manager-c0389a",
      "model_type": "jobs",
      "id": 17767489,
      "locations": [
        {
          "name": "Santa Monica, CA"
        }
      ],
      "categories": [],
      "levels": [
        {
          "name": "Senior Level",
          "short_name": "senior"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/cleanharbors/service-delivery-manager-c0389a"
      },
      "company": {
        "id": 15000557,
        "short_name": "cleanharbors",
        "name": "Clean Harbors"
      }
    },
    {
      "contents": "<div><p>SpaceX was founded under the belief that a future where humanity is out exploring the stars is fundamentally more exciting than one where we are not. Today SpaceX is actively developing the technologies to make this possible, with the ultimate goal of&nbsp;enabling human life on Mars.</p></div>\n\n<p><strong>MANAGER, EQUIPMENT AND AUTOMATION ENGINEERING (STARLINK)</strong></p>\n\n<p>As the Manager of Equipment and Automation Engineering, you will lead a team responsible for designing, developing, and implementing advanced automation systems and manufacturing equipment to support high-volume solar cell production. You will drive innovation in equipment reliability, throughput, and scalability while ensuring safety and quality standards are met. This position demands a hands-on leader passionate about rapid iteration and problem-solving in a fast-paced, high-stakes environment.</p>\n\n<p><strong>RESPONSIBILITIES:</strong></p>\n\n<ul>\n<li>Lead a team of multi-disciplinary engineers spanning the design, procurement, installation, and optimization of solar cell manufacturing equipment and automation</li>\n<li>Collaborate with production, process engineering, and supply chain teams to identify equipment needs and develop solutions that improve yield, reduce cycle times, and minimize downtime in satellite manufacturing lines.</li>\n<li>Oversee the full lifecycle of equipment projects, from concept through commissioning, including budgeting, vendor management, and root-cause analysis for failures.</li>\n<li>Implement data-driven improvements using tools like PLC programming, SCADA systems, and IoT sensors to enable predictive maintenance and real-time monitoring.</li>\n<li>Ensure compliance with industry standards (e.g., ISO, SEMI) and SpaceX safety protocols, while fostering a culture of continuous improvement and knowledge sharing.</li>\n<li>Mentor and develop team members, conduct performance reviews, and hire top talent to build a high-performing engineering group.</li>\n<li>Travel as needed (up to 20%) internationally</li>\n</ul>\n\n<p><strong>BASIC QUALIFICATIONS:</strong></p>\n\n<ul>\n<li>Bachelor's degree in an Engineering discipline</li>\n<li>5+ years of experience in equipment engineering or automation, with at least 2+ years in a project leadership or management role</li>\n<li>Experience with automation projects in a high-volume manufacturing environment (e.g., semiconductors, automotive, or aerospace)</li>\n</ul>\n\n<p><strong>PREFERRED SKILLS AND EXPERIENCE:</strong></p>\n\n<ul>\n<li>Advanced degree (Master's or PhD) in a relevant engineering discipline</li>\n<li>Experience in the aerospace or satellite manufacturing industry</li>\n<li>Experience with the equipment and support systems used to manufacture solar cells</li>\n<li>Strong knowledge of automation technologies, including robotics (e.g., FANUC, ABB), motion control systems, and CAD software (e.g., SolidWorks, AutoCAD)</li>\n<li>Experience with equipment qualification, validation, and troubleshooting in cleanroom or controlled environments</li>\n<li>Proficiency in programming for automation (e.g., Structured Text, Ladder Logic, C++) and simulation tools (e.g., MATLAB, LabVIEW)</li>\n<li>Demonstrated ability to manage budgets exceeding $10M and leading multidisciplinary teams in agile development cycles</li>\n<li>Excellent communication skills, with experience presenting technical concepts to non-technical stakeholders</li>\n<li>Passion for space exploration and alignment with SpaceX's mission to make life multi-planetary</li>\n</ul>\n\n<p><strong>ADDITIONAL REQUIREMENTS:</strong></p>\n\n<ul>\n<li>Must be willing to work extended hours and weekends as needed</li>\n</ul>\n\n<div><p><strong>ITAR REQUIREMENTS:</strong></p>\n<ul>\n<li>To conform to U.S. Government export regulations, applicant must be a (i) U.S. citizen or national, (ii) U.S. lawful, permanent resident (aka green card holder), (iii) Refugee under 8 U.S.C. § 1157, or (iv) Asylee under 8 U.S.C. § 1158, or be eligible to obtain the required authorizations from the U.S. Department of State. Learn more about the ITAR <a href=\"https://www.pmddtc.state.gov/?id=ddtc_kb_article_page&amp;sys_id=24d528fddbfc930044f9ff621f961987\" rel=\"noopener noreferrer\">here</a>. &nbsp;</li>\n</ul>\n<p>SpaceX is an Equal Opportunity Employer; employment with SpaceX is governed on the basis of merit, competence and qualifications and will not be influenced in any manner by race, color, religion, gender, national origin/ethnicity, veteran status, disability status, age, sexual orientation, gender identity, marital status, mental or physical disability or any other legally protected status.</p>\n<p>Applicants wishing to view a copy of SpaceX’s Affirmative Action Plan for veterans and individuals with disabilities, or applicants requiring reasonable accommodation to the application/interview process should reach out to&nbsp;<a href=\"mailto:EEOCompliance@spacex.com\" rel=\"noopener noreferrer\">EEOCompliance@spacex.com</a><em>.&nbsp;</em></p></div>",
      "name": "Manager, Equipment and Automation Engineering (Starlink)",
      "type": "external",
      "publication_date": "2025-12-08T18:33:25Z",
      "short_name": "manager-equipment-and-automation-engineering-starlink",
      "model_type": "jobs",
      "id": 20838284,
      "locations": [
        {
          "name": "Lockhart, TX"
        }
      ],
      "categories": [],
      "levels": [
        {
          "name": "Senior Level",
          "short_name": "senior"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/spacex/manager-equipment-and-automation-engineering-starlink"
      },
      "company": {
        "id": 15000190,
        "short_name": "spacex",
        "name": "SpaceX"
      }
    },
    {
      "contents": "<div><p>We're Celonis, the global leader in Process Mining technology and one of the world's fastest-growing SaaS firms. We believe there is a massive opportunity to unlock productivity by placing data and intelligence at the core of business processes - and for that, we need you to join us.</p></div>\n\n<p><strong>The Team:</strong><strong><br></strong>The Corporate Account Executive team is responsible for the most extensive portfolio of accounts in the company. The teams are supported by the best-in-class products, with the best sales motions, and the cooperation of other departments (Value Engineers, Partner Managers and Consulting Services ).<strong> Based in Madrid</strong>, we cover EMEA and Emerging markets, and we are rapidly expanding with excellent career growth opportunities.&nbsp;</p>\n\n<p><br><strong>The Role:</strong><br>The primary objective is to land new logos and achieve the target based on ACV (Annual contract value) generated in the region. As an Account Executive you will be an integral part to our strategy for expanding market share through targeted client acquisitions.</p>\n\n<p><strong><br></strong><strong>The work you’ll do:</strong></p>\n\n<ul>\n<li>Hunt down and discover new business opportunities in your region</li>\n<li>Collaborate with partners to land new logos</li>\n<li>Interact with all levels of the target organization up to C-level</li>\n<li>Deliver best in class use case specific demos to demonstrate the value of our solutions</li>\n<li>Understand accounts’ needs and effectively communicate how Celonis will meet those needs while ensuring 100% satisfaction with all customers</li>\n<li>You will be in charge of prospecting, leading the sales cycle, forecasting the deals and closing. (end-to-end sales cycle)</li>\n<li>The Corporate Account Executive is also responsible for the customer's success and drive potential expansion</li>\n</ul>\n\n<p><strong>The qualifications you need:</strong></p>\n\n<ul>\n<li>You have a university degree or equivalent professional training&nbsp;</li>\n<li>You have relevant work experience (3+ years) in enterprise software sales</li>\n<li>You have excellent written/verbal communication skills</li>\n<li>You have ability to multitask, prioritize, and manage time effectively</li>\n<li>You have proven experience building pipeline.</li>\n<li>You have ability to take initiative</li>\n<li>You are comfortable working in a fast-paced and dynamic environment</li>\n<li>You are skilled in using relevant technology to maximize pipe generation and deal velocity</li>\n<li>You have ability to work, build and maintain relationships at all levels</li>\n<li>You are <strong>f</strong>luent in both English<strong> and Swedish or Danish<br></strong></li>\n</ul>\n\n<p>&nbsp;</p>\n\n<div><p><strong>What Celonis Can Offer You:</strong></p>\n<ul>\n<li>The unique opportunity to work with industry-leading process mining technology</li>\n<li>Investment in your personal growth and skill development (clear career paths, internal mobility opportunities, L&amp;D platform, mentorships, and more)</li>\n<li>Great compensation and benefits packages (equity (restricted stock units), life insurance, time off, generous leave for new parents from day one, and more). For intern and working student benefits, click <a href=\"https://www.celonis.com/careers/early-professionals/faqs/\" rel=\"noopener noreferrer\">here</a>.</li>\n<li>Physical and mental well-being support (subsidized gym membership, access to counseling, virtual events on well-being topics, and more)</li>\n<li>A global and growing team of Celonauts from diverse backgrounds to learn from and work with</li>\n<li>An open-minded culture with innovative, autonomous teams</li>\n<li>Business Resource Groups to help you feel connected, valued and seen (Black@Celonis, Women@Celonis, Parents@Celonis, Pride@Celonis, Resilience@Celonis, and more)</li>\n<li>A clear set of <a href=\"https://www.celonis.com/company/values/\" rel=\"noopener noreferrer\">company values</a> that guide everything we do: Live for Customer Value, The Best Team Wins, We Own It, and Earth Is Our Future</li>\n</ul>\n<p>&nbsp;</p>\n<p><strong>About Us:</strong></p>\n<p>Celonis helps some of the world’s largest and most esteemed brands make processes work for people, companies and the planet. With over 5,000 enterprise customer deployments across nearly every industry, the Celonis Process Intelligence Platform uses process mining and AI to give you a living digital twin of your business operation. It’s system-agnostic and without bias, and empowers companies to reduce waste, create value and benefit people across the top, bottom, and green lines. Since 2011, the Celonis platform has enabled its customers to identify more than $18 billion in value. Celonis is headquartered in Munich, Germany, and New York City, USA, with more than 20 offices worldwide.</p>\n<p>Get familiar with the Celonis Process Intelligence Platform by watching this <a href=\"https://academy.celonis.com/learn/video/discover-the-ems\" rel=\"noopener noreferrer\">video</a>.</p>\n<p>&nbsp;</p>\n<p><strong>Data Privacy, Equal Opportunity, and Accessibility Information</strong></p>\n<p>Celonis is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment and equal opportunity in all aspects of employment. We will not tolerate any unlawful discrimination or harassment of any kind. We make all employment decisions without regard to race/ethnicity, color, sex, pregnancy, age, sexual orientation, gender identity or expression, transgender status, national origin, citizenship status, religion, physical or mental disability, veteran status, or any other factor protected by applicable anti-discrimination laws. As a US federal contractor, we are committed to the principles of affirmative action in accordance with applicable laws and regulations.&nbsp;<a href=\"https://www.celonis.com/careers/diversity/\" rel=\"noopener noreferrer\">Different makes us better</a>.&nbsp;</p>\n<p>Any information you submit to Celonis as part of your application will be processed in accordance with Celonis’ <a href=\"https://www.celonis.com/careers/candidate-notices\" rel=\"noopener noreferrer\">&nbsp;Statements on Data Privacy, Equal Opportunity and Accessibility.</a></p>\n<p>Please be aware of common job offer scams, impersonators and frauds. Learn more <a href=\"https://www.celonis.com/careers/fraud-alert/\" rel=\"noopener noreferrer\">here</a>.</p>\n<p>By submitting this application, you confirm that you agree to the storing and processing of your personal data by Celonis as described in our <a href=\"https://www.celonis.com/careers/privacy-notice/\" rel=\"noopener noreferrer\">Privacy Notice for the Application and Hiring Process</a>.</p></div>",
      "name": "Account Executive- Swedish speaker",
      "type": "external",
      "publication_date": "2025-03-19T23:37:39Z",
      "short_name": "account-executive-swedish-speaker",
      "model_type": "jobs",
      "id": 18256005,
      "locations": [
        {
          "name": "Madrid, Spain"
        }
      ],
      "categories": [
        {
          "name": "Sales"
        }
      ],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/celonis/account-executive-swedish-speaker"
      },
      "company": {
        "id": 15000205,
        "short_name": "celonis",
        "name": "Celonis"
      }
    },
    {
      "contents": "<p>Explore opportunities with Minden LA PCS, a part of LHC Group, a leading post-acute care partner for hospitals, physicians and families nationwide. As members of the Optum family of businesses, we are dedicated to helping people feel their best, including our team members who create meaningful connections with patients, their families, each other and the communities we serve. Find a home for your career here. Join us and embrace a culture of <strong>Caring. Connecting. Growing together.</strong></p>\n\n<p> </p>\n\n<p></p>\n\n<p><strong></strong></p>\n\n<p></p>\n\n<p>As the Home and Community Based Services Licensed Practical Nurse, you will be providing direct nursing care as prescribed by the physician to acutely ill, and/or chronically ill patients in their homes as well as recording clinical and progress notes; and coordinating other patient care activities/services to provide the highest quality of patient care in the geographic service area to which she/he is assigned. You will work under the direct supervision of the Registered Nurse and/or designated supervisor.</p>\n\n<p></p>\n\n<p></p>\n\n<p><strong>Primary Responsibilities:</strong></p>\n\n<ul><li><p>Provides high quality clinical services within the scope of practice, as defined by the state laws governing the practice of nursing, in accordance with the plan of care, and in coordination with other members of the health care team, following all applicable infection control procedures</p></li><li><p>Documents patient visits thoroughly and completely per regulatory and payer requirements in the electronic medical record utilizing the agency's electronic visit verification program (as applicable)</p></li><li><p>Actively participates in the agency's care coordination process including timely reporting patients' needs and changes in condition, attending patient case conference, communicating effectively to the patient, family, physician, other clinicians, agency management staff, and case coordinator, community case managers (as applicable)</p></li></ul>\n\n<p>You'll be rewarded and recognized for your performance in an environment that will challenge you and give you clear direction on what it takes to succeed in your role as well as provide development for other roles you may be interested in. </p>\n\n<p></p>\n\n<p><strong>Required Qualifications:</strong></p>\n\n<ul><li>Current and unrestricted Licensed Practical Nurse licensure in state of practice </li><li>Current CPR certification </li><li>Current driver's license and vehicle insurance, access to a dependable vehicle, or public transportation </li><li>Ability to function in any home situation regardless of age, race, creed, color, sex, disability, or financial condition of the client</li></ul>\n\n<p><strong>State Specific Requirements: </strong></p>\n\n<ul><li>LA: <ul><li>Current LPN Licensure in LA without restrictions</li><li><p>1+ years of experience working as an LPN</p><p> </p></li></ul></li></ul>\n\n<p><br><strong>Preferred Qualifications: </strong></p>\n\n<ul><li>Home care experience</li><li>Ability to work flexible hours as required to meet identified client needs</li><li>Ability to manage multiple tasks simultaneously</li><li>Able to work independently</li><li>Good communication, writing, and organizational skills</li></ul>\n\n<p>Pay is based on several factors including but not limited to local labor markets, education, work experience, certifications, etc. In addition to your salary, we offer benefits such as, a comprehensive benefits package, incentive and recognition programs, equity stock purchase and 401k contribution (all benefits are subject to eligibility requirements). No matter where or when you begin a career with us, you'll find a far-reaching choice of benefits and incentives. The hourly pay for this role will range from $20.00 to $35.72 per hour based on full-time employment. We comply with all minimum wage laws as applicable </p>\n\n<p>#LHCJobs</p>\n\n<p><i>At UnitedHealth Group, our mission is to help people live healthier lives and make the health system work better for everyone. We believe everyone-of every race, gender, sexuality, age, location and income-deserves the opportunity to live their healthiest life. Today, however, there are still far too many barriers to good health which are disproportionately experienced by people of color, historically marginalized groups and those with lower incomes. We are committed to mitigating our impact on the environment and enabling and delivering equitable care that addresses health disparities and improves health outcomes - an enterprise priority reflected in our mission. </i><br><i> </i><br><i> </i><br><i>UnitedHealth Group is an Equal Employment Opportunity employer under applicable law and qualified applicants will receive consideration for employment without regard to race, national origin, religion, age, color, sex, sexual orientation, gender identity, disability, or protected veteran status, or any other characteristic protected by local, state, or federal laws, rules, or regulations. </i><br><i> </i><br><i> </i><br><i>UnitedHealth Group is a drug - free workplace. Candidates are required to pass a drug test before beginning employment.</i></p>\n\n<p> </p>",
      "name": "LPN Pediatric Home Care - Rayville",
      "type": "external",
      "publication_date": "2026-01-14T07:35:26Z",
      "short_name": "lpn-pediatric-home-care-rayville-27a1b1",
      "model_type": "jobs",
      "id": 21091313,
      "locations": [
        {
          "name": "Monroe, LA"
        }
      ],
      "categories": [],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/optum/lpn-pediatric-home-care-rayville-27a1b1"
      },
      "company": {
        "id": 15000934,
        "short_name": "optum",
        "name": "Optum"
      }
    },
    {
      "contents": "<p><b><em><b>**Up to $25,000 Sign on Bonus, based on relevant experience**</b></em></b></p>\n\n<p><b> Unit Specializes in: </b>4 west is a cardiac telemetry unit designated for the care of the acutely ill adult patient with a variety of diagnoses. Whether it is assisting to manage chronic illnesses or help treat acute conditions, our collaborative team lives to serve our Community and strives to provide safe, reliable, quality care. We proudly promote professional nurse advancement and offer ACLS and arrhythmia/EKG interpretation training. RN ratios of 1:5 with acuity based assignments and PCA ratio of 1:8. We do what we do because we are driven to make a difference in the patients we serve. Come help the helpers and be a part of our team!</p>\n\n<p><b> DMC Sinai-Grace Hospital </b> is DMC’s largest hospital, offering a comprehensive heart center, cancer care, gerontology, emergency medicine, obstetrics/gynecology and cosmetic services. Sinai-Grace’s joint replacement program features a revolutionary minimally invasive knee and hip replacement surgery that attracts patients from all over the country. Sinai-Grace operates more than 21 outpatient care sites and ambulatory surgery centers throughout Wayne and Oakland Counties and is one of 10 hospitals in the nation to be awarded a Robert Wood Johnson Foundation grant to help set the standards of cardiac care for hospitals and physicians throughout the nation. </p>\n\n<p><b> JOB DESCRIPTION </b></p>\n\n<p> The Detroit Medical Center (DMC) Registered Nurse (RN) is a member of the Patient Care Services Team, and is responsible for the satisfactory completion of nursing care by the nursing team. The RN manages and provides patient care activities for a group of patients and their families through application of independent judgment, communication and collaboration with all team members including ancillary and support services. The role of the Registered Nurse at the DMC encompasses leadership, partnership, collaboration, teaching and supervision. </p>\n\n<p><b> The DMC RN: </b><br>• Establishes and maintains collaborative relationships with physicians and other health care providers <br>• Delegates, assesses, provides and evaluates patient care <br>• Provides and delegates patient care activities to team members <br>• Monitors patient progress and prepares patient for discharge <br>• Reports directly to senior unit management and participates in shared decision-making activities </p>\n\n<p></p>\n\n<p><b> Qualifications: </b><br><p><b> MINIMUM QUALIFICATIONS </b><br>1. Graduation from a school of nursing required. <br>2. BSN preferred. <br>3. Licensed to practice as a Registered Nurse (RN) in the state of Michigan required. <br>4. American Heart Association (AHA) BLS required. </p> Job: Cardio/Coronary/Tele Primary Location: Detroit, Michigan Facility: DMC Sinai-Grace Hospital Job Type: Full Time Shift Type: Night 2406003565<br><p> Employment practices will not be influenced or affected by an applicant’s or employee’s race, color, religion, sex (including pregnancy), national origin, age, disability, genetic information, sexual orientation, gender identity or expression, veteran status or any other legally protected status. Tenet will make reasonable accommodations for qualified individuals with disabilities unless doing so would result in an undue hardship. </p></p>",
      "name": "Registered Nurse Registered Nurse Med/Surg Telemetry Full Time Nights",
      "type": "external",
      "publication_date": "2025-06-10T09:59:33Z",
      "short_name": "registered-nurse-registered-nurse-medsurg-telemetry-full-time-nights-6ec354",
      "model_type": "jobs",
      "id": 19225596,
      "locations": [
        {
          "name": "Dearborn, MI"
        }
      ],
      "categories": [],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/dmcsinaigracehospital/registered-nurse-registered-nurse-medsurg-telemetry-full-time-nights-6ec354"
      },
      "company": {
        "id": 15000905,
        "short_name": "dmcsinaigracehospital",
        "name": "DMC Sinai-Grace Hospital"
      }
    },
    {
      "contents": "<p><b>Job Description:</b><br><br>At Bank of America, we are guided by a common purpose to help make financial lives better through the power of every connection. Responsible Growth is how we run our company and how we deliver for our clients, teammates, communities and shareholders every day. <br> <br>One of the keys to driving Responsible Growth is being a great place to work for our teammates around the world. We're devoted to being a diverse and inclusive workplace for everyone. We hire individuals with a broad range of backgrounds and experiences and invest heavily in our teammates and their families by offering competitive benefits to support their physical, emotional, and financial well-being. <br> <br>Bank of America believes both in the importance of working together and offering flexibility to our employees. We use a multi-faceted approach for flexibility, depending on the various roles in our organization. <br> <br>Working at Bank of America will give you a great career with opportunities to learn, grow and make an impact, along with the power to make a difference. Join us!<br><br>Job Description:<br>This job is responsible for engaging clients in the lobby to educate and assist with conducting transactions through self-service resources, such as mobile banking, online banking, or ATM. Key responsibilities include accurately and efficiently processing cash transactions for clients as needed. Job expectations include having deep conversations with clients to gain in-depth knowledge of the financial and life priorities and connecting clients to solutions that meet the financial goals.<br><br>Responsibilities:<br>•  Executes the bank's risk culture and strives for operational excellence<br>•  Builds relationships with clients to meet financial needs<br>•  Follows established processes and guidelines in daily activities to do what is right for clients and the bank, adhering to all applicable laws and regulations<br>•  Grows business knowledge and network by partnering with experts in small business, lending, and investments<br>•  Manages financial center traffic, appointments, and outbound calls effectively<br>•  Drives the client experience<br>•  Manages cash responsibilities<br><br>Required Qualifications:<br>•  Is an enthusiastic, highly motivated self-starter with a strong work ethic and intense focus on results, acting in the best interest of the client.<br>•  Collaborates effectively to get things done, building and nurturing strong relationships.<br>•  Displays passion, commitment and drive to deliver an experience that improves our clients' financial lives.<br>•  Is confident in identifying solutions for new and existing clients based on their needs.<br>•  Communicates effectively and confidently, and is comfortable engaging all clients.<br>•  Has the ability to learn and adapt to new information and technology platforms.<br>•  Is confident in educating clients on how to conduct simple banking transactions through self-service technologies (for example, ATM, online banking, mobile banking).<br>•  Applies strong critical thinking and problem-solving skills to meet clients' needs.<br>•  Will follow established processes and guidelines in daily activities to do what is right for clients and the bank, adhering to all applicable laws and regulations.<br>•  Efficiently manages time and capacity.<br>•  Focuses on results, while acting in the best interest of the client.<br>•  Can be flexible to work weekends and/or extended hours as needed.<br><br>Desired Qualifications:<br>•  Experience in financial services and knowledge of financial services industry, products and solutions.<br>•  One year of demonstrated successful sales experience in a salary plus incentive environment with individual sales goals.<br>•  Six months of cash handling experience.<br>•  Bachelor's Degree or business-relevant Associate's Degree such as business management, business administration or finance<br><br>Skills:<br>•  Adaptability<br>•  Business Acumen<br>•  Customer and Client Focus<br>•  Oral Communications<br>•  Problem Solving<br>•  Account Management<br>•  Client Experience Branding<br>•  Client Management<br>•  Client Solutions Advisory<br>•  Relationship Building<br>•  Business Development<br>•  Pipeline Management<br>•  Prospecting<br>•  Referral Identification<br>•  Referral Management<br><br>Minimum Education Requirement:<br>•  High School Diploma / GED / Secondary School or equivalent<br><br><b>Shift:</b><br>1st shift (United States of America)<br><br><b>Hours Per Week: </b><br>40</p>",
      "name": "Relationship Banker - Sarasota Market",
      "type": "external",
      "publication_date": "2025-01-17T00:02:34Z",
      "short_name": "relationship-banker-sarasota-market-ede304",
      "model_type": "jobs",
      "id": 17625191,
      "locations": [
        {
          "name": "Sarasota, FL"
        }
      ],
      "categories": [],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/bankofamerica/relationship-banker-sarasota-market-ede304"
      },
      "company": {
        "id": 12145,
        "short_name": "bankofamerica",
        "name": "Bank of America"
      }
    },
    {
      "contents": "<div><p><a href=\"https://www.avalabs.org/gh-applicant-notice\" rel=\"noopener noreferrer\">Applicant Privacy Notice</a></p>\n<p>Looking to join a world-class blockchain development team? Ava Labs makes it simple to deploy high-performance solutions for Web3, led by innovations on Avalanche. The company was founded by Cornell computer scientists, who partnered with Wall Street veterans and early Web3 leaders to execute a promising vision for redefining the way people build permissionless networks. Ava Labs is redefining the way people create value with Web3. Join us as we empower people to easily and freely digitize all the world’s assets on one open, programmable blockchain platform.</p></div>\n\n<div>\n<p>Join the AvaCloud team at Ava Labs as a <strong>Senior Technical Product Manager</strong>. AvaCloud is revolutionizing how businesses launch, manage, and scale using Avalanche L1s and web3 technologies, making blockchain simple, powerful, and accessible. We've already empowered leading organizations like <strong>J.P. Morgan Kinexys, FIFE, and Nexon’s MapleStory</strong> to bring innovative products to market, and we're just getting started.</p>\n<p>In this pivotal role, you will be instrumental in shaping the strategy, execution, and growth of the AvaCloud product suite. This involves navigating the rapidly evolving blockchain ecosystem to identify trends and opportunities that AvaCloud can address. Success requires confronting challenges directly, continuously seeking feedback for personal and product improvement, and motivating your team with excitement and engagement around the problems being solved.</p>\n<h4><strong>WHAT YOU WILL DO</strong></h4>\n<ul>\n<li>Drive the strategy, design and execution of products within the AvaCloud suite of solutions.</li>\n<li>Collaborate with engineering, business development, marketing to establish a shared understanding of the product vision with impactful business outcomes.</li>\n<li>Research and dissect product markets and customers</li>\n<li>Identify market opportunities to build product vision and strategies</li>\n<li>Work closely with engineers and other cross-functional teams to manage product milestones and delivery</li>\n<li>Execute efficiently in a fast-paced, fluid start-up environment where change is constant and creativity is a must</li>\n</ul>\n<h4><strong>WHAT YOU WILL BRING</strong></h4>\n<ul>\n<li>7+ years of technical product management in fintech, blockchain or cryptocurrency businesses</li>\n<li>2+ years managing day-to-day technical/design direction for large rapidly scaling systems and platforms</li>\n<li>A deep understanding of web3 infrastructure, explorers, bridges, defi platforms and traditional payments&nbsp;</li>\n<li>Experience driving B2B and or B2B2C software products and/or features through the full product life cycle</li>\n<li>Experience creating strategic roadmaps with internal collaborators (engineering, ux/ui, sales, customer support, finance and/or marketing)</li>\n<li>Experience leading product vision, go-to-market strategy, and design discussions</li>\n<li>Strong ability to interpret research/data and dissect industry trends</li>\n<li>Can easily translate technical concepts into non-technical terms and vice versa</li>\n<li>Experience working with and/or building developer tools including APIs and SDKs</li>\n<li>Management consulting background is a plus</li>\n</ul>\n<p><strong>Nice to Haves</strong></p>\n<ul>\n<li>Technical understanding of blockchains</li>\n<li>Engineering experience</li>\n<li>Start-up experience</li>\n</ul>\n</div>\n\n<div>\n<p><strong>Salary Range:</strong> $155,904 to $194,880</p>\n<p>(<em>**This is not a guarantee of compensation or salary, a final offer amount may vary based on factors including but not limited to experience and geographic location. NYC metro candidates are required to be in office 2-3x/week, with exceptions.)</em></p>\n<p><span>#LI-Remote #LI-RP1</span></p>\n</div>\n\n<div><p><strong>WHY AVA LABS?</strong></p>\n<p>If you've ever thought about joining an early stage Web3 company - this is it! We're a global, world-class team of experts in computer science, economics, finance, marketing, and law with offices in New York City and Miami. We're highly passionate about Web3 and redefining the way people build and use finance and decentralized applications of all kinds. The company received early-stage funding from Andreessen Horowitz, Initialized Capital, and Polychain Capital, with angel investments from Balaji Srinivasan and Naval Ravikant. Join us and be a pioneer in a new technology that will have implications across a range of verticals such as finance, gaming, investing, collectibles, among many others.</p>\n<p>Ava Labs is committed to diversity in the workplace and we’re proud to be an Equal Opportunity Employer. We do not hire on basis of race, color, religion, creed, gender, national origin, citizenship, age, disability, veteran status, marital status, pregnancy, parental status, sex, gender expression or identity, sexual orientation, or any other basis protected by local, state or federal law. All employment is decided on the basis of qualifications, merit, and business need.</p></div>",
      "name": " Senior Technical Product Manager - AvaCloud",
      "type": "external",
      "publication_date": "2025-11-13T23:31:35Z",
      "short_name": "senior-technical-product-manager-avacloud",
      "model_type": "jobs",
      "id": 20693577,
      "locations": [
        {
          "name": "Flexible / Remote"
        },
        {
          "name": "New York, NY"
        }
      ],
      "categories": [],
      "levels": [
        {
          "name": "Senior Level",
          "short_name": "senior"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/avalabs/senior-technical-product-manager-avacloud"
      },
      "company": {
        "id": 15000201,
        "short_name": "avalabs",
        "name": "Ava Labs"
      }
    },
    {
      "contents": "<p><b>Description</b> </p>\n\n<p><span><strong>Job Schedule:</strong></span> Full Time<br>  <span><strong>Standard Hours:</strong></span> 40<br>   <span><strong>Job Shift:</strong></span> Shift 1<br>   <span><strong>Shift Details:</strong></span> Monday- Friday with rotating weekends <br> <br><p>Work where <strong>every moment</strong> matters. <br><br>Every day, over 30,000 Hartford HealthCare colleagues come to work with one thing in common: Pride in what we do, knowing every moment matters here. We invite you to become part of Connecticut’s most comprehensive healthcare network. <br><br>Join us at Backus Hospital as we live our values every day. As part of Hartford HealthCare we create a better future for healthcare in Connecticut and beyond. By embodying these values we have become nationally respected for patient care and most trusted for personalized coordinated care. Come be part of something special! <br><br>For more than 118 years, Backus Hospital has been the primary source of healthcare services for much of Eastern Connecticut. We are home to the only trauma center in New London and Windham counties, and are the only area hospital with LIFE STAR helicopter services. We deliver and coordinate a continuum of high-quality healthcare with the goal of improving the health of our communities. </p><br/>\n<p><b></b> </p><br/>\n<p><b>JOB SUMMARY</b><br>Coordinates, negotiates, communicates, and manages the care of assigned patient population along a continuum to facilitate achievement of optimal patient outcomes within appropriate LOS and resource utilization parameters.</p><p><b>Qualifications</b> </p> <p><strong>Education</strong>: Graduate of a school of nursing. BSN or MSN preferred.</p></p>\n<p><strong>Experience</strong>: Two (2) to Three (3) years recent clinical nursing experience in an acute care setting required. Three (3) years recent clinical nursing experience in an acute care setting with prior Care Management experience preferred.</p>\n\n<p><strong>License and Certification: </strong>Current unrestricted License in good standing to practice as a Registered Nurse in the State of Connecticut. Current Basic Life Support (BLS) certification. Ability to obtain and maintain department specific certifications. Certified Nurse Care Manager certification preferred.</p>\n\n<div><b>KNOWLEDGE, SKILLS AND ABILITIES</b><br>\nAbility to read and understand oral and written instructions, and effectively communicate information. Basic computer skills (including opening/reading email, basic internet use).</div>\n\n<div>Working knowledge of third party payors as well as hospital's registration and billing processes. Knowledge of health care fiscal management goals and strategies including trends and issues in health care reimbursement and knowledge of care delivery system across the continuum of care. Excellent interpersonal skills necessary to communicate with departments, employees, physicians and managers. Ability to manage time and meet deadlines in a hectic work environment. Ability to handle multiple priorities. Working knowledge of windows based software. Ability to influence and persuade members of the professional staff.</div>\n\n<div> </div>\n\n<div><b>PROBLEM SOLVING AND DECISION MAKING</b><br>\nAbility to react and perform under strict timelines and/or emergency situations. Requires the ability to exercise discretion and use good judgment to perform duties promptly and consistently with little direction. Requires high level of analytical ability in order to gather and interpret information from various sources.</div>\n\n<div> </div>\n\n<div>We take great care of careers.<br>\n<br>\nWith locations around the state, Hartford HealthCare offers exciting opportunities for career development and growth. Here, you are part of an organization on the cutting edge – helping to bring new technologies, breakthrough treatments and community education to countless men, women and children. We know that a thriving organization starts with thriving employees-- we provide a competitive benefits program designed to ensure work/life balance. Every moment matters. And this is <strong>your moment</strong>.</div>",
      "name": "Nurse Care Manager (RN)",
      "type": "external",
      "publication_date": "2025-03-09T10:29:29Z",
      "short_name": "nurse-care-manager-rn-ed8155",
      "model_type": "jobs",
      "id": 17780767,
      "locations": [
        {
          "name": "Ledyard, CT"
        }
      ],
      "categories": [],
      "levels": [
        {
          "name": "Senior Level",
          "short_name": "senior"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/hartfordhealthcare/nurse-care-manager-rn-ed8155"
      },
      "company": {
        "id": 15000558,
        "short_name": "hartfordhealthcare",
        "name": "Hartford HealthCare"
      }
    },
    {
      "contents": "<div>\n Safety-Kleen in Sylmar, CA is seeking a Driver Operations Manager (Service Delivery Manager) manage the daily completion of routes by motivating and directing team members; as well as ensuring a high level of customer satisfaction. This role does this while still having a strong operational adherence to all DOT, EPA, State and Local Regulations and Safety-Kleen Policies and Procedures.\n</div>\n\n<div>\n <br> \n</div>\n\n<div>\n Safety-Kleen, a subsidiary of Clean Harbors is the leading provider of environmental, energy and industrial services throughout the United States, Canada, Mexico and Puerto Rico.  Everywhere industry meets environment, Clean Harbors is on-site, providing premier environmental, energy and industrial services. We are solving tough problems through innovation and proven methodology – come be part of the solution with us.\n</div>\n\n<div>\n <br> \n</div>\n\n<div>\n <strong>Why work for Clean Harbors?</strong>\n</div>\n\n<div>\n <ul>\n  <li>Health and Safety is our #1 priority and we live it 3-6-5!</li>\n  <li>Focus on maintaining sustainability and cleaning the Earth </li>\n  <li>Recruiting Pay range $75k-$80k </li>\n  <li>Comprehensive health benefits coverage after 30 days of full-time employment including 401K with Company match</li>\n  <li>Own part of the company with our Employee Stock Purchase Plan</li>\n  <li>Opportunities for growth and development for all the stages of your career</li>\n  <li>Company paid training and tuition reimbursement</li>\n </ul>\n</div>\n\n<div>\n <ul>\n  <li>Ensure Health and Safety is the number one priority by complying with all safe work practices, policies, and processes and always acting in a safe manner</li>\n  <li>Train, develop, and manage sales and service route drivers</li>\n  <li>Manage flow of service requests to ensure customers are serviced in a timely and efficient manner</li>\n  <li>Conduct End-of-day Check-In / Morning Check-Out process with drivers to ensure daily expectations are met and employees are prepared for the day</li>\n  <li>Fulfill duties of route driver when s/he is absent</li>\n  <li>Provide field coaching and sales training to route drivers</li>\n  <li>Meet with customers periodically to discuss needs</li>\n  <li>Increase sales portfolio by identifying opportunities</li>\n  <li>Schedule services to prevent and resolve route issues and complaints</li>\n  <li>Ensure completion and organization of all mandated paperwork and files.</li>\n  <li>Follow all local, state (provincial) and federal compliance regulations and rules</li>\n  <li>Safely operate vehicles in accordance with U.S. DOT, local, state (provincial) and federal requirements</li>\n  <li>Safely observe all corporate operating guidelines and procedures</li>\n  <li>Observe all company environmental health and safety operating guidelines</li>\n  <li>Perform other duties as assigned</li>\n </ul>\n</div>\n\n<div>\n <ul>\n  <li>Class B CDL</li>\n  <li>Obtain Hazmat and Tanker endorsements within 90 days of employment</li>\n  <li>Leadership experience</li>\n  <li>Intermediate computer skills</li>\n  <li>Excellent customer service skills </li>\n  <li>Excellent organization and attention to detail</li>\n  <li>Perform physical functions per job requirements</li>\n  <li>Successfully complete a background check, drug test, and physical, by position</li>\n </ul>\n</div>\n\n<div>\n <strong>Preferred Qualifications:</strong>\n</div>\n\n<div>\n <ul>\n  <li>Previous route driver experience</li>\n  <li>Previous dispatch/logistics experience</li>\n </ul>\n</div>\n\n<div>\n <br> \n</div>\n\n<div>\n Clean Harbors is an equal opportunity employer. We do not discriminate against applicants due to race, ancestry, color, sexual orientation, gender identity, national origin, religion, age, physical or mental disability, veteran status, or based on any other federal, state/provincial, or local protected class. \n</div>\n\n<div>\n <br> \n</div>\n\n<div>\n Clean Harbors is a Military &amp; Veteran friendly company.\n</div>\n\n<div>\n *SK\n</div>\n\n<div>\n <br> \n</div>",
      "name": "Service Delivery Manager",
      "type": "external",
      "publication_date": "2025-03-08T15:56:50Z",
      "short_name": "service-delivery-manager-d082ec",
      "model_type": "jobs",
      "id": 17766748,
      "locations": [
        {
          "name": "Burbank, CA"
        }
      ],
      "categories": [],
      "levels": [
        {
          "name": "Senior Level",
          "short_name": "senior"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/cleanharbors/service-delivery-manager-d082ec"
      },
      "company": {
        "id": 15000557,
        "short_name": "cleanharbors",
        "name": "Clean Harbors"
      }
    },
    {
      "contents": "<p><strong>Safety-Kleen</strong> is looking for a <strong>Territory Sales Representative</strong>, internally known as an Account Manager, to join their safety conscious team! This role focuses on building business within their territories as well as developing and maintaining strong customer relationships. While working in conjunction with route drivers, the Outside Sales Representative provides product insight to our clientele regarding essential lines of business.</p>\n\n<p><strong>This position requires daily visits to our local branch location.</strong></p>\n\n<ul><li>Why work for Safety-Kleen?</li><li>Health and Safety is our #1 priority and we live it 3-6-5!</li><li>Competitive wages: $65,000 - $80,000 + bonus opportunities </li><li>Comprehensive health benefits coverage after 30 days of full-time employment</li><li>Group 401K with company matching component</li><li>Generous paid time off, company paid training and tuition reimbursement</li><li>Positive and safe work environments</li><li>Opportunities for growth and development for all the stages of your career</li></ul>\n\n<ul><li>Ensures Health and Safety is the number one priority by complying with all safe work practices, policies, and processes and acting in a safe manner at all times;</li><li>Work with route drivers to convert new sales opportunities;</li><li>Grow current customer base with new lines of business;</li><li>Prepare and deliver customer quotes;</li><li>Prospect and convert leads into customers;</li><li>Achieve monthly sales quotas/budgets;</li></ul>\n\n<ul><li>Exceptional computer skills;</li><li>Tenacious, assertive, strong organizational skills and a hunter mentality;</li><li>Proven ability to develop a book of business;</li><li>Working knowledge and current use of Salesforce.com is a plus;</li><li>3+ years business to business sales experience preferred;</li></ul>\n\n<p><strong>Safety-Kleen Systems,</strong> a Clean Harbors company, has a commitment to excellence deeply rooted in a strong sense of tradition. Our entire business model revolves around keeping North American businesses green. We generate more than $1.2 billion in annual revenue as a world-class environmental service organization and market leader in industrial hazardous waste management, parts-cleaning technology, and oil re-refining. We collect over 200 million gallons of used motor oil each year and we have the largest re-refinery capacity in North America allowing us to re-refine more than 150 million gallons each year.<br> <br>Every day, we help our customers resolve their waste management needs and reduce their carbon footprint. <strong>PROTECTION. CHOICES. PEOPLE</strong>. <strong>MAKE GREEN WORK.™</strong></p>\n\n<p><strong>Join our safety focused team today!  </strong>To learn more about our company, and to apply online for this exciting opportunity, v<strong>isit us at </strong><a href=\"http://www.safety-kleen.com/careers\">www.safety-kleen.com/careers</a><strong>.</strong></p>\n\n<p><br><strong>Clean Harbors is an equal opportunity employer. We do not discriminate against applicants due to race, ancestry, color, sexual orientation, gender identity, national origin, religion, age, physical or mental disability, veteran status, or on the basis of any other federal, state/provincial or local protected class.</strong><br><br>Safety-Kleen Systems, a Clean Harbors company, is a Military &amp; Veteran friendly company.</p>\n\n<p>*SK </p>\n\n<p>#LI-SM1 </p>",
      "name": "SKE Account Manager",
      "type": "external",
      "publication_date": "2025-03-08T15:56:40Z",
      "short_name": "ske-account-manager-ff84b8",
      "model_type": "jobs",
      "id": 18054997,
      "locations": [
        {
          "name": "Seattle, WA"
        }
      ],
      "categories": [],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/cleanharbors/ske-account-manager-ff84b8"
      },
      "company": {
        "id": 15000557,
        "short_name": "cleanharbors",
        "name": "Clean Harbors"
      }
    },
    {
      "contents": "<div><p>SpaceX was founded under the belief that a future where humanity is out exploring the stars is fundamentally more exciting than one where we are not. Today SpaceX is actively developing the technologies to make this possible, with the ultimate goal of&nbsp;enabling human life on Mars.</p></div>\n\n<p><strong>IC PACKAGING AUTOMATION ENGINEER, ELECTRICAL (STARLINK)</strong></p>\n\n<p>Starlink is committed to providing fast, reliable internet to those that need it most. We design, build, and launch the world's largest and most advanced satellite constellation, that is capable of delivering high-speed internet to even the most remote locations. We also design, build, and ship the hardware that sits in the homes of our customers all around the world. And while our hardware and network are incredibly advanced, we keep the end-user experience impressively simple; our customers have internet within 10 minutes of unboxing.</p>\n\n<p>In true SpaceX fashion, Starlink is taking the next step in vertical integration by bringing semiconductor integrated circuit packaging and assembly in-house for development and manufacturing. We are looking for talented hands-on and dynamic automation engineers with expertise in semiconductor packaging and testing. You will work closely with process design engineers and process equipment manufacturers to develop and commission production packaging automation solutions. You will assume ownership of packaging automation and test as we strive to make Starlink more affordable to those who need it most.</p>\n\n<p><strong>RESPONSIBILITIES:</strong>&nbsp;</p>\n\n<ul>\n<li>Design, develop, and manage automation projects - this includes initial factory ideation, defining requirements, machine selection, machine runoff (FAT/SAT) and commissioning, proof of rate capability, and eventual hand-off to operational teams&nbsp;</li>\n<li>Design&nbsp;electrical systems compliant to NEC, NFPA, &amp; UL508A regulations</li>\n<li>Keep our factory safe and reliable by ensuring machines are compliant with appropriate electrical, mechanical, and robot safety requirements</li>\n<li>Stay organized by creating schedules and budgets, and then motivate the team to achieve them&nbsp;</li>\n</ul>\n\n<p><strong>BASIC QUALIFICATIONS:</strong>&nbsp;</p>\n\n<ul>\n<li>Bachelor's degree in an engineering, physics, computer science, or STEM discipline</li>\n<li>1+ years of experience with electrical/electromechanical design, analysis, testing, and/or manufacturing (internship experience is applicable)</li>\n</ul>\n\n<p><strong>PREFERRED SKILLS AND EXPERIENCE:</strong>&nbsp;</p>\n\n<ul>\n<li>Proven ability to solve complex problems with simple solutions in both&nbsp;design&nbsp;and implementation stages</li>\n<li>Excellent communication skills in both written and verbal, with the ability to make plans and directional recommendations collaboratively and cross-functionally</li>\n<li>Electrical sizing of motors, cables, circuit protection, VFDs, motor starters, and various other motion systems</li>\n<li>Design&nbsp;of fail-safe electrical circuits using both safety logic controllers and safety-rated relays&nbsp;</li>\n<li>Hands-on experience troubleshooting industrial electrical systems using tools like multimeters, oscilloscopes, EMI probes</li>\n<li>Proficiency in understanding and creating electrical schematics and single line diagrams (EPLAN preferred)</li>\n<li>Field Bus Networking protocols, preferably EtherCAT, Profinet, Profisafe, Ethernet/IP</li>\n<li>Knowledge of NFPA70, NFPA79, UL508A, and SEMI S22 codes with ability to ensure compliance with control system safety standards&nbsp;</li>\n<li>Familiarity with SEMI organization semiconductor standards</li>\n<li>Industrial electrical application to mechanical assemblies, electrical systems, sensors, pneumatics/hydraulics, software design, including how to safely checkout these interdisciplinary systems prior to production implementation</li>\n<li>Ability to engineer creative and new approaches to problems while adhering to NFPA/ISO/ANSI/RIA15.06/OSHA safety requirements to keep a factory safe</li>\n<li>Demonstrated willingness to develop software and mechanical technical skills</li>\n</ul>\n\n<p><strong>ADDITIONAL REQUIREMENTS:</strong>&nbsp;</p>\n\n<ul>\n<li>Ability to work long hours and weekends as necessary to support critical milestones</li>\n</ul>\n\n<div><p><strong>ITAR REQUIREMENTS:</strong></p>\n<ul>\n<li>To conform to U.S. Government export regulations, applicant must be a (i) U.S. citizen or national, (ii) U.S. lawful, permanent resident (aka green card holder), (iii) Refugee under 8 U.S.C. § 1157, or (iv) Asylee under 8 U.S.C. § 1158, or be eligible to obtain the required authorizations from the U.S. Department of State. Learn more about the ITAR <a href=\"https://www.pmddtc.state.gov/?id=ddtc_kb_article_page&amp;sys_id=24d528fddbfc930044f9ff621f961987\" rel=\"noopener noreferrer\">here</a>. &nbsp;</li>\n</ul>\n<p>SpaceX is an Equal Opportunity Employer; employment with SpaceX is governed on the basis of merit, competence and qualifications and will not be influenced in any manner by race, color, religion, gender, national origin/ethnicity, veteran status, disability status, age, sexual orientation, gender identity, marital status, mental or physical disability or any other legally protected status.</p>\n<p>Applicants wishing to view a copy of SpaceX’s Affirmative Action Plan for veterans and individuals with disabilities, or applicants requiring reasonable accommodation to the application/interview process should reach out to&nbsp;<a href=\"mailto:EEOCompliance@spacex.com\" rel=\"noopener noreferrer\">EEOCompliance@spacex.com</a><em>.&nbsp;</em></p></div>",
      "name": "IC Packaging Automation Engineer, Electrical (Starlink)",
      "type": "external",
      "publication_date": "2026-01-05T18:33:06Z",
      "short_name": "ic-packaging-automation-engineer-electrical-starlink",
      "model_type": "jobs",
      "id": 21030493,
      "locations": [
        {
          "name": "Lockhart, TX"
        }
      ],
      "categories": [],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/spacex/ic-packaging-automation-engineer-electrical-starlink"
      },
      "company": {
        "id": 15000190,
        "short_name": "spacex",
        "name": "SpaceX"
      }
    },
    {
      "contents": "<p><b><strong>About the Team</strong></b><br><br>The Ad Sales Strategy and Operations team is responsible for driving strategic initiatives in partnership with cross-functional teams to <strong>grow revenue efficiently</strong>. To achieve this, the team <strong>builds processes, workflows, tools, and dashboards that enable sales to perform at peak efficiency. </strong><br><br><b><strong>About the Role</strong></b><br><br>As a Senior Associate in Ad Sales Intelligence, your primary remit is to build SQL queries, data visualization dashboards, and custom reports for the Ads &amp; Promos sales and product teams. You will investigate data assets, map data sources, and build elegant and performant queries that support analytical and operational needs of the business. You'll then transform these queries into rich visual dashboards built with scale and efficiency top-of-mind, capable of supporting a sales team of 100+ sellers and billions in revenue. You will report into the Senior Manager of Ad Sales Strategy &amp; Operations on our broader Sales Efficiency team. We expect this role to be remote with quarterly travel for in-person meetings and team gatherings.<br><br><b><strong>You're excited about this opportunity because you will...</strong></b><br><br><ul><li><strong>Research - </strong>Comb large repositories of data tables to identify where the target data &amp; metrics can be found</li><li><strong>Experiment</strong> - Work Iteratively to establish the right methods for deriving accurate figures - testing and comparing to other known sources of truth</li><li><strong>Build - </strong>Establish \"Source of Truth\" queries and implement ETL loads to power internal revenue reporting</li><li><strong>Design - </strong>Turn your data queries into rich visuals that illustrate business performance and highlight revenue trends and risks</li><li><strong>Deploy</strong> - Create documentation for dashboard usage and navigation, and play a pivotal role in training the sales teams</li><li><strong>Support - </strong>Oversee and respond to inbound questions and discrepancy reports, investigating root causes and providing fixes and clarifications where needed</li></ul><br><b><strong>We're excited about you because...</strong></b><br><br><ul><li>You have 1+ years of experience in Revenue Analytics, Revenue Operations, Sales Strategy &amp; Operations, or a generalist role with a track record of owning revenue metrics and working with sales teams</li><li>You are fluent in SQL and have experience building dashboards in at least one data visualization platform (Tableau, Power BI, Sigma Computing, etc)</li><li>You not only have strong analytical skills, but are energized by a role solely focused on analytics and data visualization. You take pride in writing elegant queries that are easy to follow and troubleshoot.</li><li>You are comfortable solving ambiguous problems and managing multiple priorities across a wide stakeholder group. </li></ul><br>Notice to Applicants for Jobs Located in NYC or Remote Jobs Associated With Office in NYC Only<br><br>We use Covey as part of our hiring and/or promotional process for jobs in NYC and certain features may qualify it as an AEDT in NYC. As part of the hiring and/or promotion process, we provide Covey with job requirements and candidate submitted applications. We began using Covey Scout for Inbound from August 21, 2023, through December 21, 2023, and resumed using Covey Scout for Inbound again on June 29, 2024.<br><br>The Covey tool has been reviewed by an independent auditor. Results of the audit may be viewed here: Covey<br><br><strong>Compensation</strong><br><br>The successful candidate's starting pay will fall within the pay range listed below and is determined based on job-related factors including, but not limited to, skills, experience, qualifications, work location, and market conditions. Base salary is localized according to an employee's work location. Ranges are market-dependent and may be modified in the future.<br><br>In addition to base salary, the compensation for this role includes opportunities for equity grants. Talk to your recruiter for more information.<br><br>DoorDash cares about you and your overall well-being. That's why we offer a comprehensive benefits package to all regular employees, which includes a 401(k) plan with employer matching, 16 weeks of paid parental leave, wellness benefits, commuter benefits match, paid time off and paid sick leave in compliance with applicable laws (e.g. Colorado Healthy Families and Workplaces Act). DoorDash also offers medical, dental, and vision benefits, 11 paid holidays, disability and basic life insurance, family-forming assistance, and a mental health program, among others.<br><br>To learn more about our benefits, visit our careers page here.<br><br>See below for paid time off details:<br><br><ul><li><strong>For salaried roles:</strong> flexible paid time off/vacation, plus 80 hours of paid sick time per year.</li><li><strong>For hourly roles:</strong> vacation accrued at about 1 hour for every 25.97 hours worked (e.g. about 6.7 hours/month if working 40 hours/week; about 3.4 hours/month if working 20 hours/week), and paid sick time accrued at 1 hour for every 30 hours worked (e.g. about 5.8 hours/month if working 40 hours/week; about 2.9 hours/month if working 20 hours/week).</li></ul><br>The national base pay range for this position within the United States, including Illinois and Colorado.<br><br>$78,200-$115,000 USD<br><br><b>About DoorDash</b><br><br>At DoorDash, our mission to empower local economies shapes how our team members move quickly, learn, and reiterate in order to make impactful decisions that display empathy for our range of users-from Dashers to merchant partners to consumers. We are a technology and logistics company that started with door-to-door delivery, and we are looking for team members who can help us go from a company that is known for delivering food to a company that people turn to for any and all goods. <br><br>DoorDash is growing rapidly and changing constantly, which gives our team members the opportunity to share their unique perspectives, solve new challenges, and own their careers. We're committed to supporting employees' happiness, healthiness, and overall well-being by providing comprehensive benefits and perks including premium healthcare, wellness expense reimbursement, paid parental leave and more.<br><br><b>Our Commitment to Diversity and Inclusion</b><br><br>We're committed to growing and empowering a more inclusive community within our company, industry, and cities. That's why we hire and cultivate diverse teams of people from all backgrounds, experiences, and perspectives. We believe that true innovation happens when everyone has room at the table and the tools, resources, and opportunity to excel.<br><br>Statement of Non-Discrimination: In keeping with our beliefs and goals, no employee or applicant will face discrimination or harassment based on: race, color, ancestry, national origin, religion, age, gender, marital/domestic partner status, sexual orientation, gender identity or expression, disability status, or veteran status. Above and beyond discrimination and harassment based on \"protected categories,\" we also strive to prevent other subtler forms of inappropriate behavior (i.e., stereotyping) from ever gaining a foothold in our office. Whether blatant or hidden, barriers to success have no place at DoorDash. We value a diverse workforce - people who identify as women, non-binary or gender non-conforming, LGBTQIA+, American Indian or Native Alaskan, Black or African American, Hispanic or Latinx, Native Hawaiian or Other Pacific Islander, differently-abled, caretakers and parents, and veterans are strongly encouraged to apply. Thank you to the Level Playing Field Institute for this statement of non-discrimination.<br><br>Pursuant to the San Francisco Fair Chance Ordinance, Los Angeles Fair Chance Initiative for Hiring Ordinance, and any other state or local hiring regulations, we will consider for employment any qualified applicant, including those with arrest and conviction records, in a manner consistent with the applicable regulation.<br><br><strong>If you need any accommodations, please inform your recruiting contact upon initial connection.</strong></p>",
      "name": "Senior Associate, Enterprise Ad Sales Intelligence",
      "type": "external",
      "publication_date": "2026-01-06T19:20:16Z",
      "short_name": "senior-associate-enterprise-ad-sales-intelligence",
      "model_type": "jobs",
      "id": 20990913,
      "locations": [
        {
          "name": "Chicago, IL"
        },
        {
          "name": "Los Angeles, CA"
        },
        {
          "name": "New York, NY"
        },
        {
          "name": "San Francisco, CA"
        },
        {
          "name": "Seattle, WA"
        }
      ],
      "categories": [],
      "levels": [
        {
          "name": "Senior Level",
          "short_name": "senior"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/doordash/senior-associate-enterprise-ad-sales-intelligence"
      },
      "company": {
        "id": 15000097,
        "short_name": "doordash",
        "name": "DoorDash"
      }
    },
    {
      "contents": "<p><b>Job Description:</b><br><br><b>Advisor Development Program Client Associate</b><br><br>Merrill Wealth Management is a leading provider of comprehensive wealth management and investment products and services for individuals, companies, and institutions. Merrill Wealth Management is one of the largest businesses of its kind in the world specializing in goals-based wealth management, including planning for retirement, education, legacy, and other life goals through investment advice and guidance.<br><br>Merrill's Financial Advisors and Wealth Management Client Associates help pursue the life they envision through a personal relationship with their advisory team committed to their needs. We believe trust comes from transparency. Our trusted advisory teams are equipped with access to the investment insights of Merrill coupled with the banking convenience of Bank of America.<br><br>Merrill is committed to an in-office culture with specific requirements for office-based attendance and which allows for an appropriate level of flexibility for our teammates and businesses based on role-specific considerations. At Merrill, we empower you to bring your whole self to work. We value diversity in our thoughts, business, and within our employees. Our Wealth Management team represents an array of different backgrounds and bring their unique perspectives, ideas and experiences, helping to create a work community that is culture driven, resilient, results focused and effective.<br><br>The Advisor Development Program is designed for individuals excited to make a career transition and follow their passion of becoming a Financial Advisor.<br><br><b>Job Description:</b><br><br>The Wealth Management Client Associate - Advisor Development Program (WMCA - ADP) role is an entry role into our Advisor Development Program where the destination role is becoming a full-scale Financial Advisor at Merrill. This progression role is responsible for providing client service support to Financial Advisors (FAs).<br><br>As a WMCA - ADP your journey begins by obtaining your Securities Industry licenses, where you will receive dedicated study time for your Securities Industry Essentials [SIE], Series 7, and Series 66 Exams.  Your SIE, Series 7 &amp; 66 must be obtained within 120 days; (63 &amp; 65 accepted, in lieu of 66, if previously held). Once you obtain your licenses, you will be taught the foundational skills needed to be a WMCA - ADP.<br><br>This job is responsible for providing client service support to multiple FAs.  Key responsibilities include supporting enterprise strategic objectives, operational excellence goals, and client advocacy within the FA's business, while customizing solutions based on their specific needs. Job expectations include serving as the most frequent point of contact within Merrill to address all service needs of their clients and acting as a resource for FAs on the team.<br><br>Once you have reached your key milestones, including proficiency in your current role and the completion of experiential activities showcasing your ability to become an advisor, you will then progress into the next stage of the Advisor Development Program, beginning building a book of business as a Financial Advisor trainee.  You will complete dedicated training preparing you for this role and once complete you will continue to work in a Merrill office where you will be acquiring, building, and managing client relationships while considering a client's complex financial picture and guiding them with advice and solutions.<br><br>Once you complete your performance requirements as a Financial Advisor trainee you will reach the ultimate destination of becoming a Merrill Financial Advisor. You will be supported along the way with dedicated programs, tools, and resources throughout your career journey.<br><br><b>The Advisor Development Program consists of progressive roles to ultimately become a Merrill Financial Advisor.  Our progressive roles in the Advisor Development Program engage in:</b><br><br><ul><li>Developing a book of business in order to meet and exceed established performance hurdles</li><li>Effectively prioritizing and sourcing prospective clients, capitalizing on referrals, assessing customer needs, referring customers to the appropriate internal specialists, and executing highly customized solutions to meet client needs</li><li>Recommending investment products and services that are suitable for prospects based on their objectives, resources, time horizon, risk profile and preferences</li><li>Balancing investment growth, referral activities, customer follow up, prospect building, administrative compliance and personal growth and development according to both a day-to-day and longer-term planning</li><li>Organizing and managing resources (time, people, budget) to run a productive practice</li><li>Seeking the expertise of specialists, where appropriate, to identify planning and investment strategies for a client</li><li>Completing mandated training, assessments, performance goals and continuing education requirements</li></ul><br><b>We'll help you</b><br><br><ul><li><b>Build a successful career</b> at Bank of America through world-class training and on-boarding programs that set you up for success.</li><li><b>Get training and one-on-one coaching</b> from our-award winning Academy at Bank of America and local leadership who are invested in your success.</li><li><b>Grow your business knowledge </b>by using a defined consultative approach to systematically identify client needs and appropriate solutions.</li><li><b>Provide end-to-end comprehensive advice</b>, deliver client reviews/presentations with confidence and recommend strategies to help achieve their financial goals and life priorities.</li><li><b>Collaborate with core banking and investment partners.</b> Connect to all the solutions we provide through Bank of America and Merrill to meet virtually all their financial needs.</li></ul><br><b>Required Qualifications:</b><br><br><ul><li>Displays confidence working as a self-starter in a sales role</li><li>Builds strong client relationships through effective communication and collaboration</li><li>Displays a proactive mindset and effective time management</li><li>Demonstrates a results-driven growth mindset and prioritizes client interests</li><li>Identifies appropriate client solutions through application of learnings and new information</li><li>Exceptional interpersonal and relationship building skills</li><li>Effective communication skills (written and verbal)</li><li>Proven ability to quickly build trust and credibility</li><li>Proven ability to assess needs of and recommend appropriate solutions</li><li>Proven ability to work both collaboratively on a team with key partners and independently</li><li>Proven ability to listen and probe for clarity and understanding</li><li>Entrepreneurial mindset with a proven ability to source clients through extensive prospecting and networking</li><li>Strong follow-through skills</li><li>Computer/technical literacy and proficiency in applications such as Microsoft Suite</li></ul><br><b>Desired Qualifications:</b><br><br><ul><li>Bachelor's degree and/or a minimum of one year of work experience</li><li>Learns and adapts to new technology or applications</li><li>Executes multiple tasks simultaneously</li></ul><br><b>Job Responsibilities:</b><br><br><ul><li>Partners with Financial Advisors, Client Relationship Managers, and Market Supervision Managers on all aspects of client servicing, risk, investments, and banking products, while receiving appropriate guidance and escalating issues as needed</li><li>Provides excellent Client Service to the bank's clients through educating them on all of the bank's service and banking offerings</li><li>Ensures timeliness, accuracy, and completeness in client materials and follows up on all client and Financial Advisor (FA) requests</li><li>Assists with ensuring practices are in alignment with the bank's policies and procedures to support operational excellence, protect the bank's clients, and manage risk</li><li>Identifies, deepens, and maintains client relationships through emphasizing the bank's offerings and promoting incorporation of banking into day-to-day practices, while communicating outputs to the FA</li><li>Performs general business growth support functions aligned to the role of the Client Associate or Wealth Management Client Associate, providing business development, investment solutions, and/or business management support to multiple FAs</li></ul><br><b>Skills</b><b>:</b><br><br><ul><li>Account Management</li><li>Client Management</li><li>Customer and Client Focus</li><li>Issue Management</li><li>Oral Communications</li><li>Business Development</li><li>Client Solutions Advisory</li><li>Pipeline Management</li><li>Prioritization</li><li>Trade Operations Management</li><li>Administrative Services</li><li>Client Investments Management</li><li>Emotional Intelligence</li><li>Referral Identification</li><li>Written Communications</li></ul><br>This position is subject to SAFE Act registration requirements. Pursuant to the SAFE Act requirements, all employees engaged in residential loan mortgage originations must register with the federal registry system and remain in good standing. Since your position requires SAFE Act registration, you will be required to register and to submit to the required SAFE Act background check and registration process. Failure to obtain and/or maintain SAFE Act registration may result in your immediate termination. The following laws or regulations restrict or prohibit the hiring of individuals with certain specified criminal history for the position: FDIC; Safe Act; Loan Originators; and FINRA<br><br><b>Shift:</b><br>1st shift (United States of America)<br><br><b>Hours Per Week: </b><br>37.5<br><br><b>Pay Transparency details</b><br><br>US - CA - Palo Alto - 3075A Hansen Way (CA5820)<br><br>Pay and benefits information<br><br>Pay range<br><br>$35.90 - $35.90 hourly pay, offers to be determined based on experience, education and skill set.<br><br>Predictable pay<br><br>This role is compensated with a base salary and is not incentive eligible.<br><br>Benefits<br><br>This role is currently benefits eligible. We provide industry-leading benefits, access to paid time off, resources and support to our employees so they can make a genuine impact and contribute to the sustainable growth of our business and the communities we serve.</p>",
      "name": "Advisor Development Program Client Associate",
      "type": "external",
      "publication_date": "2026-01-13T19:07:34Z",
      "short_name": "advisor-development-program-client-associate-a877dc",
      "model_type": "jobs",
      "id": 21074570,
      "locations": [
        {
          "name": "Palo Alto, CA"
        }
      ],
      "categories": [],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/bankofamerica/advisor-development-program-client-associate-a877dc"
      },
      "company": {
        "id": 12145,
        "short_name": "bankofamerica",
        "name": "Bank of America"
      }
    },
    {
      "contents": "<p><b>Job Description:</b><br><br>At Bank of America, we are guided by a common purpose to help make financial lives better through the power of every connection. We do this by driving Responsible Growth and delivering for our clients, teammates, communities and shareholders every day.<br><br>Being a Great Place to Work is core to how we drive Responsible Growth. This includes our commitment to being an inclusive workplace, attracting and developing exceptional talent, supporting our teammates' physical, emotional, and financial wellness, recognizing and rewarding performance, and how we make an impact in the communities we serve.<br><br>Bank of America is committed to an in-office culture with specific requirements for office-based attendance and which allows for an appropriate level of flexibility for our teammates and businesses based on role-specific considerations.<br><br>At Bank of America, you can build a successful career with opportunities to learn, grow, and make an impact. Join us!<br><br><b>Job Description:</b><br>This job is responsible for managing a financial center and it's employees on a day-today basis. Key responsibilities include operating as a business owner and fostering a team environment, instilling an effective client-centric and risk culture in the center, and helping clients achieve the financial goals. Job expectations include ensuring operational excellence and cohesive effectiveness.<br><br><b>Responsibilities:</b><br><br><ul><li>Develops talent, including proactive sourcing of candidates</li><li>Manages client traffic, engaging and appropriately routing clients, and fostering client retention</li><li>Manages business results through formalized management routines and coaching</li><li>Creates a world class client experience environment</li><li>Manages market-level initiative prescribed by market leaders</li><li>Drives operational excellence by engaging employees on business strategy</li><li>Manages organizational priorities and effective execution</li></ul><br><b>Managerial Responsibilities:</b><br>This position may also have responsibilities for managing associates. At Bank of America, all managers at this level demonstrate the following responsibilities, in addition to those specific to the role, listed above.<br><br><ul><li>Opportunity &amp; Inclusion Champion: Creates an inclusive team where members are treated fairly and respectfully.</li><li>Manager of Process &amp; Data: Demonstrates and expects process knowledge, data driven decisions, simplicity and continuous improvement.</li><li>Enterprise Advocate &amp; Communicator: Delivers clear and concise messages that motivate, convey the \"why\" and connects contributions to business results.</li><li>Risk Manager: Leads and encourages the identification, escalation and resolution of potential risks.</li><li>People Manager &amp; Coach: Knows and develops team members through coaching and feedback.</li><li>Financial Steward: Manages expenses and demonstrates an owner's mindset.</li><li>Enterprise Talent Leader: Recruits, on-boards and develops talent, and supports talent mobility for career growth.</li><li>Driver of Business Outcomes: Delivers results through effective team management, structure, and routines.</li></ul><br><b>Required Qualifications:</b><br><br><ul><li>1+ years of leadership experience demonstrated through one or a combination of the following: coaching, training and/or motivating a diverse work team</li><li>Is an enthusiastic, highly motivated self-starter with a strong work ethic and intense focus on results, acting in the best interest of the client</li><li>Collaborates effectively to get things done, building and nurturing strong relationships</li><li>Displays passion, commitment and drive to deliver an experience that improves our clients' financial lives</li><li>Is confident in identifying solutions for clients based on their needs and can resolve problems independently or bring in others as needed</li><li>Communicates effectively and confidently and is comfortable engaging all clients</li><li>Has the ability to learn and adapt to new information and technology platforms</li><li>Applies strong critical thinking and problem-solving skills to meet clients' needs</li><li>Will follow established processes and guidelines in daily activities to do what is right for clients and the bank, adhering to all applicable laws and regulations</li><li>Efficiently manages time and capacity</li><li>Can manage complexity, prioritize tasks, delegate and execute in a fast-paced environment</li><li>Can interpret performance results, find opportunities to drive success and hold others accountable to results</li><li>Can be flexible to work weekends and/or extended hours as needed</li></ul><br><b>Desired Qualifications:</b><br><br><ul><li>1+ years of management experience including hiring, coaching and developing direct reports</li><li>Experience in financial services and knowledge of financial services industry, products and solutions</li><li>Experience working in an environment with individual and team goals where goals were routinely met or exceeded</li><li>Bilingual skills</li></ul><br><b>Skills:</b><br><br><ul><li>Coaching</li><li>Customer Service Management</li><li>Customer and Client Focus</li><li>Performance Management</li><li>Talent Development</li><li>Business Operations Management</li><li>Recruiting</li><li>Result Orientation</li><li>Risk Management</li><li>Sales Performance Management</li><li>Inclusive Leadership</li><li>Leadership Development</li><li>Prioritization</li><li>Problem Solving</li><li>Referral Management</li></ul><br><b>Minimum Education Requirement: </b>High School Diploma / GED / Secondary School or equivalent<br><br><b>Shift:</b><br>1st shift (United States of America)<br><br><b>Hours Per Week: </b><br>40</p>",
      "name": "Financial Center Manager - Asheville - Evergreen",
      "type": "external",
      "publication_date": "2025-11-14T19:03:11Z",
      "short_name": "financial-center-manager-asheville-evergreen",
      "model_type": "jobs",
      "id": 20701077,
      "locations": [
        {
          "name": "Asheville, NC"
        }
      ],
      "categories": [],
      "levels": [
        {
          "name": "Senior Level",
          "short_name": "senior"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/bankofamerica/financial-center-manager-asheville-evergreen"
      },
      "company": {
        "id": 12145,
        "short_name": "bankofamerica",
        "name": "Bank of America"
      }
    },
    {
      "contents": "<p><strong>About the Role</strong><br><br>Uber's <strong>People &amp; Places (P&amp;P)</strong> team handles all things people-related so that our employees worldwide are empowered to do their best work. Our HR Business Partner (HRBP) organization partners closely with business leaders to enable their strategies, shape organizational effectiveness, and build high-performing teams.<br><br>As a <strong>Senior HR Business Partner</strong> for <strong>Delivery Commercial Operations (DCO)</strong> and <strong>Global</strong> <strong>Strategy &amp; Planning (S&amp;P)</strong>, you'll support two critical groups that power Uber Delivery:<br><ol><li><strong>DCO</strong> drives sales operations, efficiency, and execution across global Delivery markets.</li><li><strong>S&amp;P</strong> sets the strategic agenda, allocates resources, and measures performance to ensure Delivery wins in a competitive landscape.</li></ol><br>In this role, you'll be a trusted partner to senior leaders, helping them design and scale high-impact organizations that drive growth, efficiency, and strategic clarity across Uber's Delivery business worldwide.<br><br><strong>What You'll Do:</strong><br><br><ul><li><strong>Strategic HR Partnership:</strong> Partner with DCO and S&amp;P senior leaders to shape business strategy through a people lens, ensuring teams are structured, resourced, and led to deliver impact at scale.</li><li><strong>Organizational Design &amp; Effectiveness:</strong> Drive org design discussions that enhance alignment between strategy and execution. Evaluate operating models, governance, and cross-functional interfaces to improve efficiency and decision-making.</li><li><strong>Leadership Development:</strong> Coach senior leaders and their teams, strengthen leadership pipelines, and design succession strategies to support Uber's long-term growth.</li><li><strong>Change Leadership:</strong> Guide leaders and employees through transformation, whether evolving sales ops models, centralizing processes, or shifting strategic focus. Anticipate global implications and ensure smooth adoption.</li><li><strong>Data-Driven Insights:</strong> Use people analytics and workforce data to diagnose organizational challenges, inform decision-making, and track progress against goals.</li><li><strong>Program Integration:</strong> Ensure HR programs (compensation, performance, talent development, etc.) are adopted effectively and tailored to the unique needs of DCO and S&amp;P.</li><li><strong>Culture &amp; Engagement:</strong> Champion Uber's cultural values and build engagement strategies that drive belonging, performance, and inclusion in highly analytical and execution-focused teams.</li><li><strong>Collaboration &amp; Influence:</strong> Navigate a complex matrix of stakeholders across Delivery, P&amp;P, and cross-functional partners. Influence outcomes and priorities without direct control of resources.</li></ul><br><strong>Basic Qualifications</strong><br><br><ul><li>10+ years of either progressive HR or relevant business experience</li></ul><br><strong>Preferred Qualifications</strong><br><br><ul><li>Proven ability to influence at senior levels and drive alignment across diverse stakeholders in a fast-paced, complex environment.</li><li>Strong decision-making skills with the ability to balance multiple perspectives, manage trade-offs, and align leaders to effective, principle-based outcomes.</li><li>Deep business acumen with demonstrated experience translating organizational goals into impactful people strategies.</li><li>Track record of driving organizational design, leadership development, and workforce planning at scale.</li><li>Solid understanding of global HR programs and practices, including compensation, performance management, and leadership development.</li><li>Strong analytical capabilities and comfort using data to inform decisions.</li><li>Knowledge of employment laws and their application across global contexts.</li><li>High emotional intelligence, cultural awareness, and interpersonal maturity with a global mindset.</li><li>Excellent communication and presentation skills with the ability to distill complexity into clear, actionable insights.</li><li>Experience in technology or platform businesses, ideally with a global scope and exposure to marketplace dynamics.</li></ul><br>For Chicago, IL-based roles: The base salary range for this role is USD$167,000 per year - USD$186,000 per year.<br><br>For New York, NY-based roles: The base salary range for this role is USD$186,000 per year - USD$207,000 per year.<br><br>For San Francisco, CA-based roles: The base salary range for this role is USD$186,000 per year - USD$207,000 per year.<br><br>For all US locations, you will be eligible to participate in Uber's bonus program, and may be offered an equity award &amp; other types of comp. You will also be eligible for various benefits. More details can be found at the following link https://www.uber.com/careers/benefits.<br><br>Uber's mission is to reimagine the way the world moves for the better. Here, bold ideas create real-world impact, challenges drive growth, and speed fuels progress. What moves us, moves the world - let's move it forward, together.<br><br>Uber is proud to be an Equal Opportunity employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected Veteran status, age, or any other characteristic protected by law. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you have a disability or special need that requires accommodation, please let us know by completing this form.<br><br>Offices continue to be central to collaboration and Uber's cultural identity. Unless formally approved to work fully remotely, Uber expects employees to spend at least half of their work time in their assigned office. For certain roles, such as those based at green-light hubs, employees are expected to be in-office for 100% of their time. Please speak with your recruiter to better understand in-office expectations for this role.</p>",
      "name": "Sr. HR Business Partner - Delivery",
      "type": "external",
      "publication_date": "2025-12-12T01:13:42Z",
      "short_name": "sr-hr-business-partner-delivery-655443",
      "model_type": "jobs",
      "id": 20325442,
      "locations": [
        {
          "name": "Chicago, IL"
        },
        {
          "name": "New York, NY"
        },
        {
          "name": "San Francisco, CA"
        }
      ],
      "categories": [],
      "levels": [
        {
          "name": "Senior Level",
          "short_name": "senior"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/uber/sr-hr-business-partner-delivery-655443"
      },
      "company": {
        "id": 61,
        "short_name": "uber",
        "name": "Uber"
      }
    },
    {
      "contents": "<p><b>Job Description:</b><br><br>Merrill Wealth Management is a leading provider of comprehensive wealth management and investment products and services for individuals, companies, and institutions. Merrill Wealth Management is one of the largest businesses of its kind in the world specializing in goals-based wealth management, including planning for retirement, education, legacy, and other life goals through investment advice and guidance.<br><br>Merrill's Financial Advisors and Wealth Management Client Associates help clients pursue the life they envision through a personal relationship with their advisory team committed to their needs. We believe trust comes from transparency. Our trusted advisory teams are equipped with access to the investment insights of Merrill coupled with the banking convenience of Bank of America.<br><br>At Merrill, we empower you to bring your whole self to work. We value diversity in our thoughts, business, and within our employees and clients. Our Wealth Management team represents an array of different backgrounds and bring their unique perspectives, ideas and experiences, helping to create a work community that is culture driven, resilient, results focused and effective.<br><br><b>Job Description:</b><br>This job is responsible for providing client service support to potentially multiple Financial Advisors (FAs). Key responsibilities include supporting enterprise strategic objectives, operational excellence goals, and client advocacy within the FA's business, while customizing solutions based on their specific needs. Job expectations include serving as the most frequent point of contact within Merrill to address all service needs of their clients.<br><br><b>Responsibilities:</b><br><br><ul><li>Provides excellent Client Service to the bank's clients through educating them on all of the bank's service and banking offerings</li><li>Ensures timeliness, accuracy, and completeness in client materials and follows up on all client and Financial Advisor (FA) requests</li><li>Assists with ensuring practices are in alignment with the bank's policies and procedures to support operational excellence, protect the bank's clients, and manage risk</li><li>Identifies, deepens, and maintains client relationships through emphasizing the bank's offerings and promoting incorporation of banking into day-to-day practices, while communicating outputs to the FA</li><li>Supports day-to-day team activities and needs including covering roles in times of absence or seasonal need increases, while leading with a client first mindset</li></ul><br><b>Skills:</b><br><br><ul><li>Account Management</li><li>Client Management</li><li>Customer and Client Focus</li><li>Issue Management</li><li>Oral Communications</li><li>Business Development</li><li>Client Solutions Advisory</li><li>Pipeline Management</li><li>Prioritization</li><li>Administrative Services</li><li>Emotional Intelligence</li><li>Referral Identification</li><li>Written Communications</li></ul><br><b>Desired Skills:</b><br><br><ul><li>Displays advanced industry knowledge and understanding of investment products</li><li>Bi-lingual in Spanish</li></ul><br>**The following laws or regulations restrict or prohibit the hiring of individuals with certain specified criminal history for the position: FDIC; FINRA<br><br><b>Minimum Education Requirement: </b>High School Diploma / GED / Secondary School or equivalent<br><br><b>Shift:</b><br>1st shift (United States of America)<br><br><b>Hours Per Week: </b><br>37.5<br><br><b>Pay Transparency details</b><br><br>US - CA - Los Angeles - 333 S HOPE ST - BANK OF AMERICA PLAZA (CA9193)<br><br>Pay and benefits information<br><br>Pay range<br><br>$25.00 - $37.00 hourly pay, offers to be determined based on experience, education and skill set.<br><br>Discretionary incentive eligible<br><br>This role is eligible to participate in the annual discretionary plan. Employees are eligible for an annual discretionary award based on their overall individual performance results and behaviors, the performance and contributions of their line of business and/or group; and the overall success of the Company.<br><br>Benefits<br><br>This role is currently benefits eligible. We provide industry-leading benefits, access to paid time off, resources and support to our employees so they can make a genuine impact and contribute to the sustainable growth of our business and the communities we serve.</p>",
      "name": "Wealth Management Client Associate",
      "type": "external",
      "publication_date": "2025-03-13T00:07:08Z",
      "short_name": "wealth-management-client-associate-3873a1",
      "model_type": "jobs",
      "id": 18186470,
      "locations": [
        {
          "name": "Los Angeles, CA"
        }
      ],
      "categories": [
        {
          "name": "Management"
        }
      ],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/bankofamerica/wealth-management-client-associate-3873a1"
      },
      "company": {
        "id": 12145,
        "short_name": "bankofamerica",
        "name": "Bank of America"
      }
    },
    {
      "contents": "<p><strong>Weekly pay and up to 80 hours of PTO per year!</strong><br><br>Thrive Skilled Pediatric Care, one of the leading providers of skilled pediatric home care, is seeking nurses in the <strong>Plano </strong>area.<br><br><strong>All shifts available - full time, part time</strong><br><br><strong>Apply today</strong>, and one of our recruiters will reach out and expedite your candidacy or please call 800-246-3421.<br><br>If you are interested in working for a company that believes in putting the needs of its clients first, values its nurses, and operates with a strong set of core values, then we’d love to hear from you! Pediatric experience is preferred, but not required. <br><br>We offer additional clinical training and opportunities to learn and grow.<br>Opportunities for Paid Travel!<br>No requirement to work holidays!<br><br><strong>Requirements:</strong><br>• RN/LVN with a current valid license to practice as issued by the State Board of Nursing<br>• Current CPR certification<br>• New Grads Welcome!<br><br><br><strong>About Thrive Skilled Pediatric Care</strong><br>Thrive operates in the whole ecosystem that surrounds medically complex children, working to be the care provider of choice and an integral part of the community that supports our patients through advocacy and Thrive Cares Foundation. <br><br>Thrive SPC offers competitive benefits for those who work 30+ hours, flexible schedules, and $500 referral bonuses to teammates who refer a nurse.<br><br><strong>Benefits include:</strong><br>• Medical<br>• Dental<br>• Vision<br>• Company-paid life insurance<br>• Fidelity 401K <br><br><strong>Our Purpose:</strong><br>To provide high quality clinical home care to medically fragile children so they can grow and flourish to their full potential. This purpose serves as our guiding light and provides inspiration and motivation throughout our organization.<br><br><strong>Our Core Values:</strong><br>Excellence, Respect, Integrity, Compassion, and Social Responsibility. These define how we conduct our business, informing all our strategic and operational decisions.<br><br>To learn more about Thrive SPC, please visit our website at www.thrivespc.com</p>",
      "name": "Pediatric Private Duty RN LVN",
      "type": "external",
      "publication_date": "2025-03-09T15:53:18Z",
      "short_name": "pediatric-private-duty-rn-lvn-7c964a",
      "model_type": "jobs",
      "id": 18151567,
      "locations": [
        {
          "name": "Frisco, TX"
        }
      ],
      "categories": [],
      "levels": [
        {
          "name": "Entry Level",
          "short_name": "entry"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/thriveskilledpediatriccarellc/pediatric-private-duty-rn-lvn-7c964a"
      },
      "company": {
        "id": 15001011,
        "short_name": "thriveskilledpediatriccarellc",
        "name": "Thrive Skilled Pediatric Care LLC"
      }
    },
    {
      "contents": "<div><p><b><u>PURPOSE AND SCOPE:</u></b>  </p><p>The Inpatient Services Charge Nurse is an additional responsibility� assigned to the Inpatient Services RN, for a limited period of time, and for specific additional duties, as assigned by the Program Manager.</p><p>The Inpatient Services Charge Nurse ensures appropriate provision of Acute Dialysis Services and treatments within assigned hospitals/facilities by coordinating, scheduling, and directing Acute Patient Care staff and by performing Acute treatments as needed or directed by Program manager. Assumes the provision of quality patient care to all hospitalized patients in the most efficient manner in accordance with company policy, as well as regulations set forth by the company, state and federal agencies.</p><p></p><p><b><u>PRINCIPAL DUTIES AND RESPONSIBILITIES:</u></b></p><p>Under limited supervision, applies considerable complex knowledge to perform a broad range of tasks which include but are not limited to the following:</p><ul><li>Acts as a subject matter expert and resource for staff members on assigned Inpatient Center treatment floor.</li><li>Normally receives no instruction on routine daily work, and general instructions on newly introduced assignment, but may escalate issues to Program Manager for resolution, as deemed necessary.</li><li>Coordinate and schedule direct patient care staff to provide coverage of Acute Dialysis treatments in contracted hospitals/facilities and ensure efficient patient scheduling and staff utilization in accordance with the TAP scheduling tool.</li><li>Maintain and review the daily TAP tool for all hospitals/facilities under their direct supervision and submit results to the Program Manager for review.</li><li>Ensure all Acute treatments are performed in contracted hospitals/facilities according to the established policies and procedures, and in compliance, with all applicable regulatory requirement. Ensure accurate documentation of information related to patient treatment is entered into ACES during the time of treatment.</li><li>Monitor on a daily basis ACES compliance.</li><li>Perform Quality Assessment and Improvement (QAI) Program audits as directed to ensure the provision of quality patient care and compliance with all Joint Commission requirements.</li><li>Participate in QAI meetings as requested by the Program Manager to assure proper reporting of QAI activities</li><li>Assess daily patient care needs and communicate concerns to attending physician. Implement changes in patient care/treatment as directed and in collaboration with prescribing physicians.</li><li>Perform Acute treatments according to current Charge Nurse Guidance recommendations and oversee all dialysis related medical and emergency functions.</li><li>Communicates with the physician and other members of the healthcare team to interpret, adjust, triage and complete patient care plans in the most efficient and safe manner.</li><li>Coordinate with appropriate technical staff to ensure preventative maintenance program for routine machine maintenance, to ensure the timely repair of disabled machines, to coordinate infection control measures, routine water culturing, water testing, logging of results, transportation of equipment and supplies, and communicate technical information to the staff.</li><li>Serve as liaison between the administrative staff of each hospital/facility and the Program Manager.</li><li>Practice cost containment strategies in all areas including medical supply inventory and personnel.</li><li>Reviews and comply with the Code of Business Conduct and all applicable company policies and procedures, local, state and federal laws and regulations.</li><li><span>Assist with various projects as assigned by the Program Manager.</span></li><li>Other duties as assigned.</li></ul><div><p><b><u><span>PHYSICAL DEMANDS AND WORKING CONDITIONS</span><span>:</span></u></b></p><ul><li><span>The physical demands and work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform these essential functions.</span></li><li><span>Day-to-day work includes desk and personal computer work, interaction with patients, facility staff and physicians. The position requires travel between assigned facilities and various locations within the community. (Travel to meetings may be required).  The work environment is characteristic of a health care facility with air temperature control and moderate noise levels. May be exposed to infectious and contagious diseases/materials. The position provides direct patient care that regularly involves heavy lifting and moving of patients, and assisting with ambulation. Equipment aids and/or coworkers may provide assistance. This position requires frequent, prolonged periods of standing and the employee must be able to bend over. The employee may occasionally be required to move with assistance, machines and equipment of up to 200 lbs., and may lift chemical and water solutions of up to 30 lbs. up as high as 5 feet. There is a two-person assist program and material assist� devices for the heavier items.</span></li></ul><p><span><b>SUPERVISION:</b> </span></p><p>Inpatient Services RN's, Inpatient Services PCT's  at assigned facilities</p><p><span> </span></p><p><b><span>EDUCATION</span><span>:</span></b></p><p><span>RN degree.</span></p><p><span> </span></p><p><b>EXPERIENCE AND REQUIRED SKILLS:</b>    </p><ul><li>Minimum of 9 months nursing experience; plus 3 months of specialized experience providing clinical nursing care to dialysis patients in an Acute or Chronic setting required.</li><li>6 months dialysis experience in an Acute setting preferred</li><li>Demonstrated leadership competencies and skills for the position, including continuous quality improvement, relationship development, results orientation, team building, motivating employees, performance management, and decision making.</li><li>Demonstrated management skills necessary to provide leadership in the supervision of dialysis personnel and to ensure the delivery of maximum quality care to all patients..</li><li>Excellent communication (written and verbal) interpersonal and customer service skills.</li></ul><p></p><p>The rate of pay for this position will depend on the successful candidate’s work location and qualifications, including relevant education, work experience, skills, and competencies.<br><span> </span><br>Hourly Rate: $42.00 - $71.00</p><p></p><p><span><b>EO/AA Employer: Minorities/Females/Veterans/Disability/Sexual Orientation/Gender Identity</b></span></p></div><p></p><p><span><b>Fresenius Medical Care North America maintains a drug-free workplace in accordance with applicable federal and state laws.</b></span></p></div>",
      "name": "Acute Dialysis Charge Nurse - Good Samaritan Hospital",
      "type": "external",
      "publication_date": "2025-02-10T03:51:26Z",
      "short_name": "acute-dialysis-charge-nurse-good-samaritan-hospital-258a47",
      "model_type": "jobs",
      "id": 17860968,
      "locations": [
        {
          "name": "Jersey City, NJ"
        }
      ],
      "categories": [],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/freseniusmedicalcare/acute-dialysis-charge-nurse-good-samaritan-hospital-258a47"
      },
      "company": {
        "id": 15000628,
        "short_name": "freseniusmedicalcare",
        "name": "Fresenius Medical Care"
      }
    },
    {
      "contents": "<p><b>Get a maximum of $400 in bonuses in Phoenix.<br>Earn $100 for every 10 rides in 7 days (limit 4). New drivers only. Terms apply.</b><br><br>We're looking for new drivers. Lyft's Women+ Connect feature offers more choice, opportunity, and peace of mind for women and nonbinary drivers. We're making Lyft better for everyone.<br>Sign up today and all drivers of any gender are eligible to receive our new driver offer.<br><br><b>What is Lyft?</b><br><br> Lyft is a flexible earning opportunity and a platform that connects drivers with individuals that need rides. Driving with Lyft is the perfect way to earn money on any schedule and is a great alternative to part-time, full-time and seasonal opportunities. Drivers can cash out any time with Express Pay. Drivers enjoy flexibility with no hourly requirement.<br><br><b>Why Lyft?</b><br><br><ul><li><b>Boost Your Earnings:</b> With Upfront Pay you can view the fare for a ride before you accept it, giving you more control of your earnings. Plus, you keep 100% of your tips.</li><li><b>Peace of Mind:</b> In addition to a suite of products designed to make driving more comfortable, Women and nonbinary drivers can turn on Women+ Connect to increase their chances of matching with more women and nonbinary riders, offering more control over their driving experience</li> <li><b>Be Your Own Boss:</b> Set your own schedule and keep control over when you drive and earn</li></ul><br><b>Our Vision</b><br><br><ul><li><b>Making Rideshare Better:</b> Diverse communities are stronger, more interesting communities. Making Lyft better for everyone</li><li><b>Community Connections:</b> Good vibes. Conversations that turn into friendships. Comfortable silence. Our Women+ Connect is here to improve the ride experience for all drivers and riders</li></ul><br><b>Driver Requirements</b><br><br><ul><li>You're at least 25 years old</li> <li>You own an iPhone or Android smartphone</li> <li>You have a clean driving record and auto insurance</li> <li>You have a 4-door from 2008 or newer </li><em>Car year may vary by region<br><br></em>Does not apply if you are renting a car through Express Drive program</ul><br><b>Additional information</b><br><br> You might consider driving with Lyft to earn extra money, driving with Lyft is a great way to supplement your part time or full time income. Driving can be a great summer gig for teachers, or for anyone looking for seasonal or summer work. No experience is needed, but you may be a great fit if you have experience in the public or private transportation industry such as a delivery driver, professional driver, chauffeur, luxury driver, truck driver, school bus driver, taxi driver or cab driver.</p>",
      "name": "Drive with Lyft - Earn on Your Own Schedule",
      "type": "external",
      "publication_date": "2025-08-27T13:55:40Z",
      "short_name": "drive-with-lyft-earn-on-your-own-schedule-176779",
      "model_type": "jobs",
      "id": 18660712,
      "locations": [
        {
          "name": "Phoenix, AZ"
        }
      ],
      "categories": [
        {
          "name": "Software Engineering"
        }
      ],
      "levels": [
        {
          "name": "Senior Level",
          "short_name": "senior"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/lyft/drive-with-lyft-earn-on-your-own-schedule-176779"
      },
      "company": {
        "id": 11895,
        "short_name": "lyft",
        "name": "Lyft"
      }
    }
  ],
  "aggregations": {}
}